# InteractionType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EditorInteraction..::..InteractionType Property
EditorInteraction Class See Also
---
The type of interaction.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual EditorInteractionType InteractionType { get; set; }
```

Visual Basic
---
```text
Public Overridable Property InteractionType As EditorInteractionType
	Get
	Set
```

Visual C++
---
```text
public:
virtual property EditorInteractionType InteractionType {
	EditorInteractionType get ();
	void set (EditorInteractionType value);
}
```

# Remarks
This property is overridable to allow for clients to dynamically return the type. For example, if your pane interacts with certain editors or has different "modes" based on user workflow.
# See Also
EditorInteraction Class
Autodesk.Revit.UI Namespace